______________________________________________________________________________________________________________
Layer (type)                        Output Shape            Param #      Connected to                         
==============================================================================================================
input_1 (InputLayer)                (None, 96, 96, 96, 1)   0                                                 
______________________________________________________________________________________________________________
conv_0_bn_reluconv (Conv3D)         (None, 96, 96, 96, 16)  432          input_1[0][0]                        
______________________________________________________________________________________________________________
conv_0_bn_relu_bn (BatchNormalizati (None, 96, 96, 96, 16)  64           conv_0_bn_reluconv[0][0]             
______________________________________________________________________________________________________________
activation_1 (Activation)           (None, 96, 96, 96, 16)  0            conv_0_bn_relu_bn[0][0]              
______________________________________________________________________________________________________________
res_1_0_bn_0 (BatchNormalization)   (None, 96, 96, 96, 16)  64           activation_1[0][0]                   
______________________________________________________________________________________________________________
activation_2 (Activation)           (None, 96, 96, 96, 16)  0            res_1_0_bn_0[0][0]                   
______________________________________________________________________________________________________________
res_1_0conv_0 (Conv3D)              (None, 96, 96, 96, 16)  6912         activation_2[0][0]                   
______________________________________________________________________________________________________________
res_1_0_bn_1 (BatchNormalization)   (None, 96, 96, 96, 16)  64           res_1_0conv_0[0][0]                  
______________________________________________________________________________________________________________
activation_3 (Activation)           (None, 96, 96, 96, 16)  0            res_1_0_bn_1[0][0]                   
______________________________________________________________________________________________________________
res_1_0conv_1 (Conv3D)              (None, 96, 96, 96, 16)  6912         activation_3[0][0]                   
______________________________________________________________________________________________________________
lambda_1 (Lambda)                   (None, 96, 96, 96, 16)  0            activation_1[0][0]                   
______________________________________________________________________________________________________________
add_1 (Add)                         (None, 96, 96, 96, 16)  0            res_1_0conv_1[0][0]                  
                                                                         lambda_1[0][0]                       
______________________________________________________________________________________________________________
res_1_1_bn_0 (BatchNormalization)   (None, 96, 96, 96, 16)  64           add_1[0][0]                          
______________________________________________________________________________________________________________
activation_4 (Activation)           (None, 96, 96, 96, 16)  0            res_1_1_bn_0[0][0]                   
______________________________________________________________________________________________________________
res_1_1conv_0 (Conv3D)              (None, 96, 96, 96, 16)  6912         activation_4[0][0]                   
______________________________________________________________________________________________________________
res_1_1_bn_1 (BatchNormalization)   (None, 96, 96, 96, 16)  64           res_1_1conv_0[0][0]                  
______________________________________________________________________________________________________________
activation_5 (Activation)           (None, 96, 96, 96, 16)  0            res_1_1_bn_1[0][0]                   
______________________________________________________________________________________________________________
res_1_1conv_1 (Conv3D)              (None, 96, 96, 96, 16)  6912         activation_5[0][0]                   
______________________________________________________________________________________________________________
lambda_2 (Lambda)                   (None, 96, 96, 96, 16)  0            add_1[0][0]                          
______________________________________________________________________________________________________________
add_2 (Add)                         (None, 96, 96, 96, 16)  0            res_1_1conv_1[0][0]                  
                                                                         lambda_2[0][0]                       
______________________________________________________________________________________________________________
res_1_2_bn_0 (BatchNormalization)   (None, 96, 96, 96, 16)  64           add_2[0][0]                          
______________________________________________________________________________________________________________
activation_6 (Activation)           (None, 96, 96, 96, 16)  0            res_1_2_bn_0[0][0]                   
______________________________________________________________________________________________________________
res_1_2conv_0 (Conv3D)              (None, 96, 96, 96, 16)  6912         activation_6[0][0]                   
______________________________________________________________________________________________________________
res_1_2_bn_1 (BatchNormalization)   (None, 96, 96, 96, 16)  64           res_1_2conv_0[0][0]                  
______________________________________________________________________________________________________________
activation_7 (Activation)           (None, 96, 96, 96, 16)  0            res_1_2_bn_1[0][0]                   
______________________________________________________________________________________________________________
res_1_2conv_1 (Conv3D)              (None, 96, 96, 96, 16)  6912         activation_7[0][0]                   
______________________________________________________________________________________________________________
lambda_3 (Lambda)                   (None, 96, 96, 96, 16)  0            add_2[0][0]                          
______________________________________________________________________________________________________________
add_3 (Add)                         (None, 96, 96, 96, 16)  0            res_1_2conv_1[0][0]                  
                                                                         lambda_3[0][0]                       
______________________________________________________________________________________________________________
res_2_0_bn_0 (BatchNormalization)   (None, 96, 96, 96, 16)  64           add_3[0][0]                          
______________________________________________________________________________________________________________
activation_8 (Activation)           (None, 96, 96, 96, 16)  0            res_2_0_bn_0[0][0]                   
______________________________________________________________________________________________________________
res_2_0conv_0 (Conv3D)              (None, 96, 96, 96, 32)  13824        activation_8[0][0]                   
______________________________________________________________________________________________________________
res_2_0_bn_1 (BatchNormalization)   (None, 96, 96, 96, 32)  128          res_2_0conv_0[0][0]                  
______________________________________________________________________________________________________________
activation_9 (Activation)           (None, 96, 96, 96, 32)  0            res_2_0_bn_1[0][0]                   
______________________________________________________________________________________________________________
res_2_0conv_1 (Conv3D)              (None, 96, 96, 96, 32)  27648        activation_9[0][0]                   
______________________________________________________________________________________________________________
lambda_4 (Lambda)                   (None, 96, 96, 96, 32)  0            add_3[0][0]                          
______________________________________________________________________________________________________________
add_4 (Add)                         (None, 96, 96, 96, 32)  0            res_2_0conv_1[0][0]                  
                                                                         lambda_4[0][0]                       
______________________________________________________________________________________________________________
res_2_1_bn_0 (BatchNormalization)   (None, 96, 96, 96, 32)  128          add_4[0][0]                          
______________________________________________________________________________________________________________
activation_10 (Activation)          (None, 96, 96, 96, 32)  0            res_2_1_bn_0[0][0]                   
______________________________________________________________________________________________________________
res_2_1conv_0 (Conv3D)              (None, 96, 96, 96, 32)  27648        activation_10[0][0]                  
______________________________________________________________________________________________________________
res_2_1_bn_1 (BatchNormalization)   (None, 96, 96, 96, 32)  128          res_2_1conv_0[0][0]                  
______________________________________________________________________________________________________________
activation_11 (Activation)          (None, 96, 96, 96, 32)  0            res_2_1_bn_1[0][0]                   
______________________________________________________________________________________________________________
res_2_1conv_1 (Conv3D)              (None, 96, 96, 96, 32)  27648        activation_11[0][0]                  
______________________________________________________________________________________________________________
lambda_5 (Lambda)                   (None, 96, 96, 96, 32)  0            add_4[0][0]                          
______________________________________________________________________________________________________________
add_5 (Add)                         (None, 96, 96, 96, 32)  0            res_2_1conv_1[0][0]                  
                                                                         lambda_5[0][0]                       
______________________________________________________________________________________________________________
res_2_2_bn_0 (BatchNormalization)   (None, 96, 96, 96, 32)  128          add_5[0][0]                          
______________________________________________________________________________________________________________
activation_12 (Activation)          (None, 96, 96, 96, 32)  0            res_2_2_bn_0[0][0]                   
______________________________________________________________________________________________________________
res_2_2conv_0 (Conv3D)              (None, 96, 96, 96, 32)  27648        activation_12[0][0]                  
______________________________________________________________________________________________________________
res_2_2_bn_1 (BatchNormalization)   (None, 96, 96, 96, 32)  128          res_2_2conv_0[0][0]                  
______________________________________________________________________________________________________________
activation_13 (Activation)          (None, 96, 96, 96, 32)  0            res_2_2_bn_1[0][0]                   
______________________________________________________________________________________________________________
res_2_2conv_1 (Conv3D)              (None, 96, 96, 96, 32)  27648        activation_13[0][0]                  
______________________________________________________________________________________________________________
lambda_6 (Lambda)                   (None, 96, 96, 96, 32)  0            add_5[0][0]                          
______________________________________________________________________________________________________________
add_6 (Add)                         (None, 96, 96, 96, 32)  0            res_2_2conv_1[0][0]                  
                                                                         lambda_6[0][0]                       
______________________________________________________________________________________________________________
res_3_0_bn_0 (BatchNormalization)   (None, 96, 96, 96, 32)  128          add_6[0][0]                          
______________________________________________________________________________________________________________
activation_14 (Activation)          (None, 96, 96, 96, 32)  0            res_3_0_bn_0[0][0]                   
______________________________________________________________________________________________________________
res_3_0conv_0 (Conv3D)              (None, 96, 96, 96, 64)  55296        activation_14[0][0]                  
______________________________________________________________________________________________________________
res_3_0_bn_1 (BatchNormalization)   (None, 96, 96, 96, 64)  256          res_3_0conv_0[0][0]                  
______________________________________________________________________________________________________________
activation_15 (Activation)          (None, 96, 96, 96, 64)  0            res_3_0_bn_1[0][0]                   
______________________________________________________________________________________________________________
res_3_0conv_1 (Conv3D)              (None, 96, 96, 96, 64)  110592       activation_15[0][0]                  
______________________________________________________________________________________________________________
lambda_7 (Lambda)                   (None, 96, 96, 96, 64)  0            add_6[0][0]                          
______________________________________________________________________________________________________________
add_7 (Add)                         (None, 96, 96, 96, 64)  0            res_3_0conv_1[0][0]                  
                                                                         lambda_7[0][0]                       
______________________________________________________________________________________________________________
res_3_1_bn_0 (BatchNormalization)   (None, 96, 96, 96, 64)  256          add_7[0][0]                          
______________________________________________________________________________________________________________
activation_16 (Activation)          (None, 96, 96, 96, 64)  0            res_3_1_bn_0[0][0]                   
______________________________________________________________________________________________________________
res_3_1conv_0 (Conv3D)              (None, 96, 96, 96, 64)  110592       activation_16[0][0]                  
______________________________________________________________________________________________________________
res_3_1_bn_1 (BatchNormalization)   (None, 96, 96, 96, 64)  256          res_3_1conv_0[0][0]                  
______________________________________________________________________________________________________________
activation_17 (Activation)          (None, 96, 96, 96, 64)  0            res_3_1_bn_1[0][0]                   
______________________________________________________________________________________________________________
res_3_1conv_1 (Conv3D)              (None, 96, 96, 96, 64)  110592       activation_17[0][0]                  
______________________________________________________________________________________________________________
lambda_8 (Lambda)                   (None, 96, 96, 96, 64)  0            add_7[0][0]                          
______________________________________________________________________________________________________________
add_8 (Add)                         (None, 96, 96, 96, 64)  0            res_3_1conv_1[0][0]                  
                                                                         lambda_8[0][0]                       
______________________________________________________________________________________________________________
res_3_2_bn_0 (BatchNormalization)   (None, 96, 96, 96, 64)  256          add_8[0][0]                          
______________________________________________________________________________________________________________
activation_18 (Activation)          (None, 96, 96, 96, 64)  0            res_3_2_bn_0[0][0]                   
______________________________________________________________________________________________________________
res_3_2conv_0 (Conv3D)              (None, 96, 96, 96, 64)  110592       activation_18[0][0]                  
______________________________________________________________________________________________________________
res_3_2_bn_1 (BatchNormalization)   (None, 96, 96, 96, 64)  256          res_3_2conv_0[0][0]                  
______________________________________________________________________________________________________________
activation_19 (Activation)          (None, 96, 96, 96, 64)  0            res_3_2_bn_1[0][0]                   
______________________________________________________________________________________________________________
res_3_2conv_1 (Conv3D)              (None, 96, 96, 96, 64)  110592       activation_19[0][0]                  
______________________________________________________________________________________________________________
lambda_9 (Lambda)                   (None, 96, 96, 96, 64)  0            add_8[0][0]                          
______________________________________________________________________________________________________________
add_9 (Add)                         (None, 96, 96, 96, 64)  0            res_3_2conv_1[0][0]                  
                                                                         lambda_9[0][0]                       
______________________________________________________________________________________________________________
conv_1_bn_reluconv (Conv3D)         (None, 96, 96, 96, 80)  5120         add_9[0][0]                          
______________________________________________________________________________________________________________
conv_1_bn_relu_bn (BatchNormalizati (None, 96, 96, 96, 80)  320          conv_1_bn_reluconv[0][0]             
______________________________________________________________________________________________________________
activation_20 (Activation)          (None, 96, 96, 96, 80)  0            conv_1_bn_relu_bn[0][0]              
______________________________________________________________________________________________________________
conv_2_bnconv (Conv3D)              (None, 96, 96, 96, 160) 12800        activation_20[0][0]                  
______________________________________________________________________________________________________________
conv_2_bn (BatchNormalization)      (None, 96, 96, 96, 160) 640          conv_2_bnconv[0][0]                  
______________________________________________________________________________________________________________
activation_21 (Activation)          (None, 96, 96, 96, 160) 0            conv_2_bn[0][0]                      
==============================================================================================================
Total params: 823,664
Trainable params: 18,400
Non-trainable params: 805,264
______________________________________________________________________________________________________________
