______________________________________________________________________________________________________________
Layer (type)                                     Output Shape                                Param #          
==============================================================================================================
input_1 (InputLayer)                             (None, 193, 229, 193, 1)                    0                
______________________________________________________________________________________________________________
conv1 (Conv3D)                                   (None, 191, 227, 191, 11)                   308              
______________________________________________________________________________________________________________
bn1 (BatchNormalization)                         (None, 191, 227, 191, 11)                   44               
______________________________________________________________________________________________________________
pool1 (MaxPooling3D)                             (None, 95, 113, 95, 11)                     0                
______________________________________________________________________________________________________________
conv2 (Conv3D)                                   (None, 93, 111, 93, 11)                     3278             
______________________________________________________________________________________________________________
bn2 (BatchNormalization)                         (None, 93, 111, 93, 11)                     44               
______________________________________________________________________________________________________________
pool2 (MaxPooling3D)                             (None, 46, 55, 46, 11)                      0                
______________________________________________________________________________________________________________
conv3 (Conv3D)                                   (None, 44, 53, 44, 11)                      3278             
______________________________________________________________________________________________________________
bn3 (BatchNormalization)                         (None, 44, 53, 44, 11)                      44               
______________________________________________________________________________________________________________
pool3 (MaxPooling3D)                             (None, 22, 26, 22, 11)                      0                
______________________________________________________________________________________________________________
conv4 (Conv3D)                                   (None, 20, 24, 20, 11)                      3278             
______________________________________________________________________________________________________________
bn4 (BatchNormalization)                         (None, 20, 24, 20, 11)                      44               
______________________________________________________________________________________________________________
pool4 (MaxPooling3D)                             (None, 10, 12, 10, 11)                      0                
______________________________________________________________________________________________________________
flatten_1 (Flatten)                              (None, 13200)                               0                
______________________________________________________________________________________________________________
fc0 (Dense)                                      (None, 4096)                                54071296         
______________________________________________________________________________________________________________
dropout_1 (Dropout)                              (None, 4096)                                0                
______________________________________________________________________________________________________________
fc1 (Dense)                                      (None, 4096)                                16781312         
______________________________________________________________________________________________________________
activation_1 (Activation)                        (None, 4096)                                0                
______________________________________________________________________________________________________________
dropout_2 (Dropout)                              (None, 4096)                                0                
______________________________________________________________________________________________________________
fc3 (Dense)                                      (None, 2)                                   8194             
==============================================================================================================
Total params: 70,871,120
Trainable params: 70,871,032
Non-trainable params: 88
______________________________________________________________________________________________________________
